package gr.uniwa.apice.Enums;

public enum Courses {
    C("Προγραμματισμός Υπολογιστών","1ο","Βασικός Κύκλος Σπουδών"),
    CPP("Αντικειμενοστρεφής Προγραμματισμός","2ο","Βασικός Κύκλος Σπουδών"),
    LOGICDESIGN("Ψηφιακή Σχεδίαση","2ο","Βασικός Κύκλος Σπουδών"),
    CIRCUITTHEORY("Θεωρία Κυκλωμάτων","2ο","Βασικός Κύκλος Σπουδών"),
    ELECTRONICS("Ηλεκτρονική","3ο","Βασικός Κύκλος Σπουδών"),
    DATASTRUCTURES("Δομές Δεδομένων","3ο","Βασικός Κύκλος Σπουδών"),
    NETWORKS1("Δίκτυα Ι","3ο","Βασικός Κύκλος Σπουδών"),
    OPERATIONALSYS1("Λειτουργικά Συστήματα Ι","3ο","Βασικός Κύκλος Σπουδών"),
    PCARCHITECTURE("Αρχιτεκτονική Υπολογιστών","3ο","Βασικός Κύκλος Σπουδών"),
    DB1("Βάσεις Δεδομένων Ι","4ο","Βασικός Κύκλος Σπουδών"),
    NETWORKS2("Δίκτυα ΙΙ","4ο","Βασικός Κύκλος Σπουδών"),
    OPERATIONALSYS2("Λειτουργικά Συστήματα ΙΙ","4ο","Βασικός Κύκλος Σπουδών"),
    JAVA("Μεθοδολογίες Ανάπτυξης Εφαρμογών","4ο","Βασικός Κύκλος Σπουδών"),
    DIGITALCIRCUITDESIGN("Σχεδίαση Ψηφιακών Συστημάτων","4ο","Βασικός Κύκλος Σπουδών"),
    SIGNALSANDSYSTEMS("Σήματα και Συστήματα","4ο","Βασικός Κύκλος Σπουδών"),
    DB2("Βάσεις Δεδομένων ΙΙ","5ο","Βασικός Κύκλος Σπουδών"),
    NETWORKPROGRAMMING("Δικτυακός Προγραμματισμός","5ο","Βασικός Κύκλος Σπουδών"),
    ANALYSISANDDESIGNOFSYSTEMS("Ανάλυση και Σχεδίαση Πληροφοριακών Συστημάτων","5ο","Βασικός Κύκλος Σπουδών"),
    AI("Τεχνητή Νοημοσύνη","5ο","Βασικός Κύκλος Σπουδών"),
    DIGITALSIGNALPROCESSING("Ψηφιακή Επεξεργασία Σήματος","5ο","Βασικός Κύκλος Σπουδών"),
    INTROTOPARALLELPROGRAMMING("Εισαγωγή στον Παράλληλο Προγραμματισμό","5ο","Βασικός Κύκλος Σπουδών"),
    SOFTWAREENGINEERING("Τεχνολογία Λογισμικού","6ο","Βασικός Κύκλος Σπουδών"),
    SAFETYONINFORMATICS("Ασφάλεια στην Τεχνολογία της Πληροφορίας","6ο","Βασικός Κύκλος Σπουδών"),
    COMPILERS("Μεταγλωττιστές","6ο","Βασικός Κύκλος Σπουδών"),
    MICROELECTRONICS("Μικροηλεκτρονική","6ο","Βασικός Κύκλος Σπουδών"),
    DISTRIBUTEDSYSTEMS("Κατανεμημένα Συστήματα","6ο","Βασικός Κύκλος Σπουδών"),
    DIGITALCOMMUNICATIONS("Ψηφιακές Επικοινωνίες","6ο","Βασικός Κύκλος Σπουδών"),
    HISTORYOFTECHNOLOGY("Ιστορία της Πληροφορίας","Μάθημα Γενικής Παιδείας"),
    INFORMATICSANDSOCIETY("Πληροφορική και Κοινωνία– Τεχνική της Έκφρασης","Μαθημα Γενικής Παιδείας"),
    DESIGNANDDEVELOPMENTOFOS("Σχεδιασμός και Ανάπτυξη Πληροφοριακών Συστημάτων","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    INFORMATIONRETRIEVAL("Ανάκτηση Πληροφορίας","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    PATTERNRECOGNITIONMACHINELEARNING("Αναγνώριση Προτύπων και Μηχανική Μάθηση","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    SPECIALSOFTWAREENGINEERING("Ειδικά Θέματα Τεχνολογίας Λογισμικού","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    IMGPROCESSING("Επεξεργασία Εικόνας","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    OPERATIONALRESEARCH("Επιχειρησιακή Έρευνα","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    MODELINGANDPROGRAMMINGRESTRICTIONS("Μοντελοποίηση και Προγραμματισμός Περιορισμών","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    MANAGEMENTINFOSYS("Πληροφοριακά Συστήματα Διοίκησης","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    HEALTHINFORMATICS("Πληροφορική Υγείας","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    SOFTWAREQUALITY("Ποιότητα και Αξιοπιστία Λογισμικού","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    SYSTEMSOFDECISION("Συστήματα Αποφάσεων και Διαχείρισης Διεργασιών","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    PERSONANDPC("Αλληλεπίδραση Ανθρώπου – Υπολογιστή","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    GRAPHICS("Γραφικά Υπολογιστών","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    NATURALLANGUAGEPROCESSING("Επεξεργασία Φυσικής Γλώσσας και Σημασιολογικός Ιστός","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    CLEVERSYSTEMS("Ευφυή Συστήματα και Συστήματα Υποστήριξης Αποφάσεων","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    ESTUDY("Ηλεκτρονική Μάθηση","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    ESHOPS("Ηλεκτρονικό Εμπόριο – Επιχειρηματικότητα","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    THEORYOFGRAPHS("Θεωρία Γραφημάτων και Εφαρμογές","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    NEURALNETWORKS("Νευρωνικά Δίκτυα","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    COMPUTERVISION("Όραση Υπολογιστών","Ροή Λογισμικού και Πληροφοριακών Συστημάτων"),
    MICROCOMPUTERS("Μικροϋπολογιστές","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    DESIGNSYSTEMWITHCOMPUTER("Σχεδίαση Συστημάτων με Χρήση Υπολογιστή","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    BIOMECHANICSINFORMATICS("Βιομηχανική Πληροφορική","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    EMBEDDEDSYSTEMS("Ενσωματωμένα Συστήματα","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    INTEGRATEDCIRCUITS("Ολοκληρωμένα Κυκλώματα για Εξειδικευμένες Εφαρμογές","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    PARALLELSYSTEMS("Παράλληλα Συστήματα","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    ROBOTICS("Ρομποτική","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    DESIGNVLSI("Σχεδίαση Ολοκληρωμένων Κυκλωμάτων VLSI","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    HIGHRELIABILITYSYS("Υπολογιστικά Συστήματα Υψηλής Αξιοπιστίας","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    AUTOSYSCONTROL("Αυτόματος Έλεγχος Συστημάτων","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    ADVANCEDCOMPUTERARCHITECTURE("Προηγμένη Αρχιτεκτονική Υπολογιστών","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    SAFETYANDRELIABILITYOFHARDWARE("Ασφάλεια και Αξιοπιστία Υλικού","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    MECHANOTRONICS("Μηχατρονική","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    ADVANCECIRCUITDESIGN("Προηγμένη Σχεδίαση και Σύνθεση Ψηφιακών Συστημάτων","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    DIGITALCONTROLOFSYSTEMS("Ψηφιακός Έλεγχος Συστημάτων","Ροή Υλικού και Υπολογιστικών Συστημάτων"),
    NETWORKSAFETY("Ασφάλεια Δικτύων και Επικοινωνιών","Ροή Δικτύων Υπολογιστών και Επικοινωνιών"),
    ADVANCEDNETWORKTECHS("Προηγμένες Δικτυακές Τεχνολογίες","Ροή Δικτύων Υπολογιστών και Επικοινωνιών"),
    IOT("Διαδίκτυο των Αντικειμένων","Ροή Δικτύων Υπολογιστών και Επικοινωνιών"),
    TELECOMS("Τηλεπικοινωνιακά Συστήματα","Ροή Δικτύων Υπολογιστών και Επικοινωνιών"),
    MOBILENETWORKS("Δίκτυα Κινητών Επικοινωνιών","Ροή Δικτύων Υπολογιστών και Επικοινωνιών"),
    CLOUDCOMPUTING("Υπολογιστική Νέφους και Υπηρεσίες","Ροή Δικτύων Υπολογιστών και Επικοινωνιών"),
    WIRELESSSYSTEMS("Ασύρματα Δίκτυα Αισθητήρων-","Ροή Δικτύων Υπολογιστών και Επικοινωνιών"),
    NETWORKINGDEFINEBYSOFTWARE("Δικτύωση Οριζόμενη από Λογισμικό","Ροή Δικτύων Υπολογιστών και Επικοινωνιών"),
    MULTIMEDIAS("Πολυμέσα και Πολυμεσικές Επικοινωνίες","Ροή Δικτύων Υπολογιστών και Επικοινωνιών"),
    TECHNOLOGYANDDESIGNOFMOBILES("Τεχνολογία και Προγραμματισμός Κινητών Συσκευών","Ροή Δικτύων Υπολογιστών και Επικοινωνιών")
    ;

    private String fullname;
    private String semester;
    private String direction;

    Courses(String fullname, String direction) {
        this.fullname = fullname;
        this.direction = direction;
    }

    Courses(String fullname, String semester, String direction) {
        this.fullname = fullname;
        this.semester = semester;
        this.direction = direction;
    }

    public String getSemester() {
        return semester;
    }

    public void setSemester(String semester) {
        this.semester = semester;
    }

    public String getDirection() {
        return direction;
    }

    public void setDirection(String direction) {
        this.direction = direction;
    }

    public String getFullname() {
        return fullname;
    }

    public void setFullname(String fullname) {
        this.fullname = fullname;
    }
}
